In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass # To get the password without showing the input

In [2]:
# put your SQL root password here when prompted
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'

In [4]:
engine = create_engine(connection_string)
query = '''select t.type, t.operation, t.amount as t_amount, t.balance, t.k_symbol, l.amount as l_amount, l.duration, l.payments, l.status
from trans t
left join loan l
on t.account_id = l.account_id;'''

In [5]:
data = pd.read_sql_query(query, engine)
data.head()

,type,operation,t_amount,balance,k_symbol,l_amount,duration,payments,status
0,INCOMING,VKLAD,700.0,700.0,,NaN,NaN,NaN,None
1,INCOMING,VKLAD,900.0,900.0,,NaN,NaN,NaN,None
2,INCOMING,VKLAD,1000.0,1000.0,,NaN,NaN,NaN,None
3,INCOMING,VKLAD,600.0,600.0,,NaN,NaN,NaN,None
4,INCOMING,VKLAD,400.0,400.0,,NaN,NaN,NaN,None